## Plan Result (test-uksouth-test)




<pre><code>Plan: 91 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.perftest-idam-internal.azurerm_private_dns_zone.zone[0]
  * module.perftest-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;bastion-nonprod-vnet&#34;]
  * module.perftest-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-idam-perftest-internal&#34;]
  * module.perftest-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-mgmt&#34;]
  * module.perftest-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-perftest-internal&#34;]
  * module.perftest-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;mgmt-infra-prod&#34;]
  * module.perftest-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;pet-stg-vnet&#34;]
  * module.perftest-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;reform-mgmt-core-vnet&#34;]
  * module.perftest-internal.azurerm_private_dns_a_record.this[&#34;neuvector00&#34;]
  * module.perftest-internal.azurerm_private_dns_a_record.this[&#34;neuvector01&#34;]
  * module.perftest-internal.azurerm_private_dns_zone.zone[0]
  * module.perftest-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;bastion-nonprod-vnet&#34;]
  * module.perftest-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-idam-perftest-internal&#34;]
  * module.perftest-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-mgmt&#34;]
  * module.perftest-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-perftest-internal&#34;]
  * module.perftest-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;mgmt-infra-prod&#34;]
  * module.perftest-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;pet-stg-vnet&#34;]
  * module.perftest-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;reform-mgmt-core-vnet&#34;]
  * module.perftest-platform.azurerm_private_dns_a_record.this[&#34;alertmanager-00&#34;]
  * module.perftest-platform.azurerm_private_dns_a_record.this[&#34;alertmanager-01&#34;]
  * module.perftest-platform.azurerm_private_dns_a_record.this[&#34;camunda-bpm&#34;]
  * module.perftest-platform.azurerm_private_dns_a_record.this[&#34;camunda-optimize&#34;]
  * module.perftest-platform.azurerm_private_dns_a_record.this[&#34;ccd-admin-web&#34;]
  * module.perftest-platform.azurerm_private_dns_a_record.this[&#34;ccd-logstash&#34;]
  * module.perftest-platform.azurerm_private_dns_a_record.this[&#34;cft-api-mgmt&#34;]
  * module.perftest-platform.azurerm_private_dns_a_record.this[&#34;docmosis&#34;]
  * module.perftest-platform.azurerm_private_dns_a_record.this[&#34;idam-web-admin&#34;]
  * module.perftest-platform.azurerm_private_dns_a_record.this[&#34;prometheus-00&#34;]
  * module.perftest-platform.azurerm_private_dns_a_record.this[&#34;prometheus-01&#34;]
  * module.perftest-platform.azurerm_private_dns_cname_record.this[&#34;administer-orgs&#34;]
  * module.perftest-platform.azurerm_private_dns_cname_record.this[&#34;adoption-web&#34;]
  * module.perftest-platform.azurerm_private_dns_cname_record.this[&#34;bar&#34;]
  * module.perftest-platform.azurerm_private_dns_cname_record.this[&#34;benefit-appeal&#34;]
  * module.perftest-platform.azurerm_private_dns_cname_record.this[&#34;bulkscan&#34;]
  * module.perftest-platform.azurerm_private_dns_cname_record.this[&#34;decree-absolute-aks&#34;]
  * module.perftest-platform.azurerm_private_dns_cname_record.this[&#34;decree-nisi-aks&#34;]
  * module.perftest-platform.azurerm_private_dns_cname_record.this[&#34;fact&#34;]
  * module.perftest-platform.azurerm_private_dns_cname_record.this[&#34;fact-admin&#34;]
  * module.perftest-platform.azurerm_private_dns_cname_record.this[&#34;fees-register&#34;]
  * module.perftest-platform.azurerm_private_dns_cname_record.this[&#34;gateway-ccd&#34;]
  * module.perftest-platform.azurerm_private_dns_cname_record.this[&#34;idam-api&#34;]
  * module.perftest-platform.azurerm_private_dns_cname_record.this[&#34;idam-keycloak&#34;]
  * module.perftest-platform.azurerm_private_dns_cname_record.this[&#34;idam-testing-support-api&#34;]
  * module.perftest-platform.azurerm_private_dns_cname_record.this[&#34;idam-user-dashboard&#34;]
  * module.perftest-platform.azurerm_private_dns_cname_record.this[&#34;idam-web-public&#34;]
  * module.perftest-platform.azurerm_private_dns_cname_record.this[&#34;immigration-appeal&#34;]
  * module.perftest-platform.azurerm_private_dns_cname_record.this[&#34;lau&#34;]
  * module.perftest-platform.azurerm_private_dns_cname_record.this[&#34;manage-case&#34;]
  * module.perftest-platform.azurerm_private_dns_cname_record.this[&#34;manage-org&#34;]
  * module.perftest-platform.azurerm_private_dns_cname_record.this[&#34;moneyclaims&#34;]
  * module.perftest-platform.azurerm_private_dns_cname_record.this[&#34;moneyclaims-legal&#34;]
  * module.perftest-platform.azurerm_private_dns_cname_record.this[&#34;nfdiv&#34;]
  * module.perftest-platform.azurerm_private_dns_cname_record.this[&#34;nfdiv-apply-for-divorce&#34;]
  * module.perftest-platform.azurerm_private_dns_cname_record.this[&#34;nfdiv-end-civil-partnership&#34;]
  * module.perftest-platform.azurerm_private_dns_cname_record.this[&#34;paybubble&#34;]
  * module.perftest-platform.azurerm_private_dns_cname_record.this[&#34;paymentoutcome-web&#34;]
  * module.perftest-platform.azurerm_private_dns_cname_record.this[&#34;pcq&#34;]
  * module.perftest-platform.azurerm_private_dns_cname_record.this[&#34;petitioner-frontend-aks&#34;]
  * module.perftest-platform.azurerm_private_dns_cname_record.this[&#34;plum&#34;]
  * module.perftest-platform.azurerm_private_dns_cname_record.this[&#34;privatelaw&#34;]
  * module.perftest-platform.azurerm_private_dns_cname_record.this[&#34;probate&#34;]
  * module.perftest-platform.azurerm_private_dns_cname_record.this[&#34;reformscan&#34;]
  * module.perftest-platform.azurerm_private_dns_cname_record.this[&#34;register-org&#34;]
  * module.perftest-platform.azurerm_private_dns_cname_record.this[&#34;respond-divorce-aks&#34;]
  * module.perftest-platform.azurerm_private_dns_cname_record.this[&#34;return-case-doc-ccd&#34;]
  * module.perftest-platform.azurerm_private_dns_cname_record.this[&#34;sscs-cor&#34;]
  * module.perftest-platform.azurerm_private_dns_cname_record.this[&#34;www-ccd&#34;]
  * module.perftest-platform.azurerm_private_dns_zone.zone[0]
  * module.perftest-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;bastion-nonprod-vnet&#34;]
  * module.perftest-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-idam-perftest-internal&#34;]
  * module.perftest-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-mgmt&#34;]
  * module.perftest-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-perftest-internal&#34;]
  * module.perftest-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;mgmt-infra-prod&#34;]
  * module.perftest-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;pet-stg-vnet&#34;]
  * module.perftest-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;reform-mgmt-core-vnet&#34;]
  * module.test-platform.azurerm_private_dns_a_record.this[&#34;hmi-pact&#34;]
  * module.test-platform.azurerm_private_dns_a_record.this[&#34;hmi-wiremock&#34;]
  * module.test-platform.azurerm_private_dns_a_record.this[&#34;sds-api-mgmt&#34;]
  * module.test-platform.azurerm_private_dns_a_record.this[&#34;traefik-sds-00&#34;]
  * module.test-platform.azurerm_private_dns_a_record.this[&#34;traefik-sds-01&#34;]
  * module.test-platform.azurerm_private_dns_cname_record.this[&#34;hmi-apim&#34;]
  * module.test-platform.azurerm_private_dns_cname_record.this[&#34;sds-neuvector00&#34;]
  * module.test-platform.azurerm_private_dns_cname_record.this[&#34;sds-neuvector00-api&#34;]
  * module.test-platform.azurerm_private_dns_cname_record.this[&#34;sds-neuvector01&#34;]
  * module.test-platform.azurerm_private_dns_cname_record.this[&#34;sds-neuvector01-api&#34;]
  * module.test-platform.azurerm_private_dns_cname_record.this[&#34;toffee&#34;]
  * module.test-platform.azurerm_private_dns_zone.zone[0]
  * module.test-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;bastion-nonprod-vnet&#34;]
  * module.test-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-mgmt&#34;]
  * module.test-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;hmi-sharedinfra-vnet-test&#34;]
  * module.test-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;reform-mgmt-core-vnet&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.perftest-idam-internal.azurerm_private_dns_zone.zone[0] will be created
  + resource "azurerm_private_dns_zone" "zone" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "service.core-compute-idam-perftest.internal"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "core-infra-intsvc-rg"
      + tags                                                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "testing"
        }

      + soa_record {
          + email         = (known after apply)
          + expire_time   = (known after apply)
          + fqdn          = (known after apply)
          + host_name     = (known after apply)
          + minimum_ttl   = (known after apply)
          + refresh_time  = (known after apply)
          + retry_time    = (known after apply)
          + serial_number = (known after apply)
          + tags          = (known after apply)
          + ttl           = (known after apply)
        }
    }

  # module.perftest-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["bastion-nonprod-vnet"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "bastion-nonprod-vnet"
      + private_dns_zone_name = "service.core-compute-idam-perftest.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "testing"
        }
      + virtual_network_id    = "/subscriptions/b44eb479-9ae2-42e7-9c63-f3c599719b6f/resourceGroups/bastion-nonprod-rg/providers/Microsoft.Network/virtualNetworks/bastion-nonprod-vnet"
    }

  # module.perftest-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-idam-perftest-internal"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-idam-perftest-internal"
      + private_dns_zone_name = "service.core-compute-idam-perftest.internal"
      + registration_enabled  = true
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "testing"
        }
      + virtual_network_id    = "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c/resourceGroups/core-infra-idam-perftest/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-idam-perftest"
    }

  # module.perftest-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-mgmt"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-mgmt"
      + private_dns_zone_name = "service.core-compute-idam-perftest.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "testing"
        }
      + virtual_network_id    = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/rg-mgmt/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-mgmt"
    }

  # module.perftest-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-perftest-internal"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-perftest-internal"
      + private_dns_zone_name = "service.core-compute-idam-perftest.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "testing"
        }
      + virtual_network_id    = "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c/resourceGroups/core-infra-perftest/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-perftest"
    }

  # module.perftest-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["mgmt-infra-prod"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "mgmt-infra-prod"
      + private_dns_zone_name = "service.core-compute-idam-perftest.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "testing"
        }
      + virtual_network_id    = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/mgmt-infra-prod/providers/Microsoft.Network/virtualNetworks/mgmt-infra-prod"
    }

  # module.perftest-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["pet-stg-vnet"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "pet-stg-vnet"
      + private_dns_zone_name = "service.core-compute-idam-perftest.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "testing"
        }
      + virtual_network_id    = "/subscriptions/58a2ce36-4e09-467b-8330-d164aa559c68/resourceGroups/pet_stg_network_resource_group/providers/Microsoft.Network/virtualNetworks/pet_stg_network"
    }

  # module.perftest-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["reform-mgmt-core-vnet"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "reform-mgmt-core-vnet"
      + private_dns_zone_name = "service.core-compute-idam-perftest.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "testing"
        }
      + virtual_network_id    = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtCoreRG/providers/Microsoft.Network/virtualNetworks/reformMgmtCoreVNet"
    }

  # module.perftest-internal.azurerm_private_dns_a_record.this["neuvector00"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "neuvector00"
      + records             = [
          + "10.48.79.250",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "service.core-compute-perftest.internal"
    }

  # module.perftest-internal.azurerm_private_dns_a_record.this["neuvector01"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "neuvector01"
      + records             = [
          + "10.48.95.250",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "service.core-compute-perftest.internal"
    }

  # module.perftest-internal.azurerm_private_dns_zone.zone[0] will be created
  + resource "azurerm_private_dns_zone" "zone" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "service.core-compute-perftest.internal"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "core-infra-intsvc-rg"
      + tags                                                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "testing"
        }

      + soa_record {
          + email         = (known after apply)
          + expire_time   = (known after apply)
          + fqdn          = (known after apply)
          + host_name     = (known after apply)
          + minimum_ttl   = (known after apply)
          + refresh_time  = (known after apply)
          + retry_time    = (known after apply)
          + serial_number = (known after apply)
          + tags          = (known after apply)
          + ttl           = (known after apply)
        }
    }

  # module.perftest-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["bastion-nonprod-vnet"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "bastion-nonprod-vnet"
      + private_dns_zone_name = "service.core-compute-perftest.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "testing"
        }
      + virtual_network_id    = "/subscriptions/b44eb479-9ae2-42e7-9c63-f3c599719b6f/resourceGroups/bastion-nonprod-rg/providers/Microsoft.Network/virtualNetworks/bastion-nonprod-vnet"
    }

  # module.perftest-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-idam-perftest-internal"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-idam-perftest-internal"
      + private_dns_zone_name = "service.core-compute-perftest.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "testing"
        }
      + virtual_network_id    = "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c/resourceGroups/core-infra-idam-perftest/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-idam-perftest"
    }

  # module.perftest-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-mgmt"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-mgmt"
      + private_dns_zone_name = "service.core-compute-perftest.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "testing"
        }
      + virtual_network_id    = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/rg-mgmt/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-mgmt"
    }

  # module.perftest-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-perftest-internal"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-perftest-internal"
      + private_dns_zone_name = "service.core-compute-perftest.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "testing"
        }
      + virtual_network_id    = "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c/resourceGroups/core-infra-perftest/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-perftest"
    }

  # module.perftest-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["mgmt-infra-prod"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "mgmt-infra-prod"
      + private_dns_zone_name = "service.core-compute-perftest.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "testing"
        }
      + virtual_network_id    = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/mgmt-infra-prod/providers/Microsoft.Network/virtualNetworks/mgmt-infra-prod"
    }

  # module.perftest-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["pet-stg-vnet"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "pet-stg-vnet"
      + private_dns_zone_name = "service.core-compute-perftest.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "testing"
        }
      + virtual_network_id    = "/subscriptions/58a2ce36-4e09-467b-8330-d164aa559c68/resourceGroups/pet_stg_network_resource_group/providers/Microsoft.Network/virtualNetworks/pet_stg_network"
    }

  # module.perftest-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["reform-mgmt-core-vnet"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "reform-mgmt-core-vnet"
      + private_dns_zone_name = "service.core-compute-perftest.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "testing"
        }
      + virtual_network_id    = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtCoreRG/providers/Microsoft.Network/virtualNetworks/reformMgmtCoreVNet"
    }

  # module.perftest-platform.azurerm_private_dns_a_record.this["alertmanager-00"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "alertmanager-00"
      + records             = [
          + "10.48.79.250",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.perftest-platform.azurerm_private_dns_a_record.this["alertmanager-01"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "alertmanager-01"
      + records             = [
          + "10.48.95.250",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.perftest-platform.azurerm_private_dns_a_record.this["camunda-bpm"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "camunda-bpm"
      + records             = [
          + "10.48.96.111",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.perftest-platform.azurerm_private_dns_a_record.this["camunda-optimize"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "camunda-optimize"
      + records             = [
          + "10.48.96.111",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.perftest-platform.azurerm_private_dns_a_record.this["ccd-admin-web"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "ccd-admin-web"
      + records             = [
          + "10.48.96.111",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.perftest-platform.azurerm_private_dns_a_record.this["ccd-logstash"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "ccd-logstash"
      + records             = [
          + 

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

)
      + id                  = (known after apply)
      + name                = "return-case-doc-ccd"
      + record              = "hmcts-perftest.azurefd.net."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.perftest-platform.azurerm_private_dns_cname_record.this["sscs-cor"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "sscs-cor"
      + record              = "hmcts-perftest.azurefd.net."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.perftest-platform.azurerm_private_dns_cname_record.this["www-ccd"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "www-ccd"
      + record              = "hmcts-perftest.azurefd.net."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.perftest-platform.azurerm_private_dns_zone.zone[0] will be created
  + resource "azurerm_private_dns_zone" "zone" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "perftest.platform.hmcts.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "core-infra-intsvc-rg"
      + tags                                                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "testing"
        }

      + soa_record {
          + email         = (known after apply)
          + expire_time   = (known after apply)
          + fqdn          = (known after apply)
          + host_name     = (known after apply)
          + minimum_ttl   = (known after apply)
          + refresh_time  = (known after apply)
          + retry_time    = (known after apply)
          + serial_number = (known after apply)
          + tags          = (known after apply)
          + ttl           = (known after apply)
        }
    }

  # module.perftest-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link["bastion-nonprod-vnet"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "bastion-nonprod-vnet"
      + private_dns_zone_name = "perftest.platform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "testing"
        }
      + virtual_network_id    = "/subscriptions/b44eb479-9ae2-42e7-9c63-f3c599719b6f/resourceGroups/bastion-nonprod-rg/providers/Microsoft.Network/virtualNetworks/bastion-nonprod-vnet"
    }

  # module.perftest-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-idam-perftest-internal"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-idam-perftest-internal"
      + private_dns_zone_name = "perftest.platform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "testing"
        }
      + virtual_network_id    = "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c/resourceGroups/core-infra-idam-perftest/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-idam-perftest"
    }

  # module.perftest-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-mgmt"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-mgmt"
      + private_dns_zone_name = "perftest.platform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "testing"
        }
      + virtual_network_id    = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/rg-mgmt/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-mgmt"
    }

  # module.perftest-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-perftest-internal"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-perftest-internal"
      + private_dns_zone_name = "perftest.platform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "testing"
        }
      + virtual_network_id    = "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c/resourceGroups/core-infra-perftest/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-perftest"
    }

  # module.perftest-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link["mgmt-infra-prod"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "mgmt-infra-prod"
      + private_dns_zone_name = "perftest.platform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "testing"
        }
      + virtual_network_id    = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/mgmt-infra-prod/providers/Microsoft.Network/virtualNetworks/mgmt-infra-prod"
    }

  # module.perftest-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link["pet-stg-vnet"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "pet-stg-vnet"
      + private_dns_zone_name = "perftest.platform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "testing"
        }
      + virtual_network_id    = "/subscriptions/58a2ce36-4e09-467b-8330-d164aa559c68/resourceGroups/pet_stg_network_resource_group/providers/Microsoft.Network/virtualNetworks/pet_stg_network"
    }

  # module.perftest-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link["reform-mgmt-core-vnet"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "reform-mgmt-core-vnet"
      + private_dns_zone_name = "perftest.platform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "testing"
        }
      + virtual_network_id    = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtCoreRG/providers/Microsoft.Network/virtualNetworks/reformMgmtCoreVNet"
    }

  # module.test-platform.azurerm_private_dns_a_record.this["hmi-pact"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "hmi-pact"
      + records             = [
          + "10.141.15.250",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "test.platform.hmcts.net"
    }

  # module.test-platform.azurerm_private_dns_a_record.this["hmi-wiremock"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "hmi-wiremock"
      + records             = [
          + "10.141.15.250",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "test.platform.hmcts.net"
    }

  # module.test-platform.azurerm_private_dns_a_record.this["sds-api-mgmt"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "sds-api-mgmt"
      + records             = [
          + "10.141.33.133",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "test.platform.hmcts.net"
    }

  # module.test-platform.azurerm_private_dns_a_record.this["traefik-sds-00"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "traefik-sds-00"
      + records             = [
          + "10.141.15.250",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "test.platform.hmcts.net"
    }

  # module.test-platform.azurerm_private_dns_a_record.this["traefik-sds-01"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "traefik-sds-01"
      + records             = [
          + "10.141.31.250",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "test.platform.hmcts.net"
    }

  # module.test-platform.azurerm_private_dns_cname_record.this["hmi-apim"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "hmi-apim"
      + record              = "hmcts-perftest.azurefd.net."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "test.platform.hmcts.net"
    }

  # module.test-platform.azurerm_private_dns_cname_record.this["sds-neuvector00"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "sds-neuvector00"
      + record              = "traefik-sds-00.test.platform.hmcts.net"
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "test.platform.hmcts.net"
    }

  # module.test-platform.azurerm_private_dns_cname_record.this["sds-neuvector00-api"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "sds-neuvector00-api"
      + record              = "traefik-sds-00.test.platform.hmcts.net"
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "test.platform.hmcts.net"
    }

  # module.test-platform.azurerm_private_dns_cname_record.this["sds-neuvector01"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "sds-neuvector01"
      + record              = "traefik-sds-01.test.platform.hmcts.net"
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "test.platform.hmcts.net"
    }

  # module.test-platform.azurerm_private_dns_cname_record.this["sds-neuvector01-api"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "sds-neuvector01-api"
      + record              = "traefik-sds-01.test.platform.hmcts.net"
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "test.platform.hmcts.net"
    }

  # module.test-platform.azurerm_private_dns_cname_record.this["toffee"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "toffee"
      + record              = "sdshmcts-test.azurefd.net."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "test.platform.hmcts.net"
    }

  # module.test-platform.azurerm_private_dns_zone.zone[0] will be created
  + resource "azurerm_private_dns_zone" "zone" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "test.platform.hmcts.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "core-infra-intsvc-rg"
      + tags                                                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "testing"
        }

      + soa_record {
          + email         = (known after apply)
          + expire_time   = (known after apply)
          + fqdn          = (known after apply)
          + host_name     = (known after apply)
          + minimum_ttl   = (known after apply)
          + refresh_time  = (known after apply)
          + retry_time    = (known after apply)
          + serial_number = (known after apply)
          + tags          = (known after apply)
          + ttl           = (known after apply)
        }
    }

  # module.test-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link["bastion-nonprod-vnet"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "bastion-nonprod-vnet"
      + private_dns_zone_name = "test.platform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "testing"
        }
      + virtual_network_id    = "/subscriptions/b44eb479-9ae2-42e7-9c63-f3c599719b6f/resourceGroups/bastion-nonprod-rg/providers/Microsoft.Network/virtualNetworks/bastion-nonprod-vnet"
    }

  # module.test-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-mgmt"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-mgmt"
      + private_dns_zone_name = "test.platform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "testing"
        }
      + virtual_network_id    = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/rg-mgmt/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-mgmt"
    }

  # module.test-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link["hmi-sharedinfra-vnet-test"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "hmi-sharedinfra-vnet-test"
      + private_dns_zone_name = "test.platform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "testing"
        }
      + virtual_network_id    = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/hmi-sharedinfra-test-rg/providers/Microsoft.Network/virtualNetworks/hmi-sharedinfra-vnet-test"
    }

  # module.test-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link["reform-mgmt-core-vnet"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "reform-mgmt-core-vnet"
      + private_dns_zone_name = "test.platform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "testing"
        }
      + virtual_network_id    = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtCoreRG/providers/Microsoft.Network/virtualNetworks/reformMgmtCoreVNet"
    }

Plan: 91 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":420,"Program":"tfcmt","SHA1":"","Target":"test-uksouth-test","Vars":{}} -->